{
  "employees": [
    {
      "id": 1,
      "name": "Wonder Woman 1984",
      "rating": 7.6,
      "imdb": 7.6,
      "duration": "2h 31m",
      "description": "In 1984, after saving the world in Чудо-женщина (2017), the immortal Amazon warrior, Princess Diana of Themyscira, finds herself trying to stay under the radar, working as an archaeologist at the Smithsonian Museum. With the memory of the brave U.S. pilot, Captain Steve Trevor, etched on her mind, Diana Prince becomes embroiled in a sinister conspiracy of global proportions when a transparent, golden-yellow citrine gemstone catches the eye of the power-hungry entrepreneur, Maxwell Lord. Now, as a dear old friend from the past miraculously enters the picture, and Barbara Minerva, Diana's insecure gemologist colleague, gives in to desire, suddenly, deceit, greed, and false promises catapult Maxwell into the limelight. More and more, cataclysmic events push the world to the brink, and emotionally vulnerable Diana must address a cruel dilemma. Can mighty Wonder Woman save humankind once again?",
      "year": 2020,
      "released": "14 January 2020",
      "boxOffice": "$169 601 036 ",
      "country": "United States",
      "production": "Atlas Entertainment, DC Entertainment, The Stone Quarry",
      "actors": "Gal Gadot, Chris Pine, Kristen Wiig",
      "director": "Patty Jenkins",
      "writers": "Patty Jenkins, Geoff Johns",
      "genres": ["Action", "Adventure", "Fantasy"],
      "favourites": false
    },
    {
      "id": 2,
      "name": "Star Wars: Episode VII - The Force Awakens",
      "rating": 7.8,
      "imdb": 7.4,
      "duration": "2h 18m",
      "description": "30 years after the defeat of Darth Vader and the Empire, Rey, a scavenger from the planet Jakku, finds a BB-8 droid that knows the whereabouts of the long lost Luke Skywalker. Rey, as well as a rogue stormtrooper and two smugglers, are thrown into the middle of a battle between the Resistance and the daunting legions of the First Order.",
      "year": 2015,
      "released": "17 December 2015",
      "boxOffice": "$2,071,310,218 ",
      "country": "United States",
      "production": "Lucasfilm, Bad Robot, Walt Disney Picture",
      "actors": "Daisy Ridley, Oscar Isaac, John Boyega, Harrison Ford",
      "director": "J.J. Abrams",
      "writers": "J.J. Abrams, Michael Arndt, Lawrence Kasdan",
      "genres": ["Action", "Adventure", "Sci-Fi"],
      "favourites": false
    },
    {
      "id": 3,
      "name": "Aquaman",
      "rating": 6.8,
      "imdb": 6.4,
      "duration": "2h 23m",
      "description": "Born upon the shores of the surface world, Arthur Curry (Jason Momoa) discovers that he is only half human, with the other half of his blood being of Atlanteean descent, thus making him the rightful heir to the throne of the undersea kingdom of Atlantis. However, Arthur learns that Atlantis is being ruled by his malicious half-brother Orm (Patrick Wilson), who seeks to unite the seven underwater kingdoms and wage war upon the surface. With aid from Nuidis Vulko (Willem Dafoe) and the gorgeous Mera (Amber Heard), Arthur must discover the full potential of his true destiny and become Aquaman in order to save Atlantis and the surface from Orm's evil plot.",
      "year": 2018,
      "released": "13 December 2018",
      "boxOffice": "$1,148,528,393 ",
      "country": "United States, Australia",
      "production": "The Safran Company, DC Entertainment, Warner Bros.",
      "actors": "Jason Momoa, Amber Heard, Willem Dafoe",
      "director": "James Wan",
      "writers": "David Leslie, Johnson-McGoldrick, Will Beall",
      "genres": ["Action", "Adventure", "Sci-Fi", "Fantasy"],
      "favourites": false
    },
    {
      "id": 4,
      "name": "Joker",
      "rating": 8.4,
      "imdb": 8.2,
      "duration": "2h 2m",
      "description": "Arthur Fleck works as a clown and is an aspiring stand-up comic. He has mental health issues, part of which involves uncontrollable laughter. Times are tough and, due to his issues and occupation, Arthur has an even worse time than most. Over time these issues bear down on him, shaping his actions, making him ultimately take on the persona he is more known as...Joker.",
      "year": 2019,
      "released": "3 October 2019",
      "boxOffice": "$1,074,458,282 ",
      "country": "United States, Canada",
      "production": "Village Roadshow Pictures, Village Roadshow Pictures, Warner Bros.",
      "actors": "Joaquin Phoenix, Robert De Niro, Zazie Beetz",
      "director": "Todd Phillips",
      "writers": "Todd Phillips, Scott Silver, Bob Kane",
      "genres": ["Crime", "Drama", "Thriller"],
      "favourites": false
    },
    {
      "id": 5,
      "name": "Bumblebee",
      "rating": 6.2,
      "imdb": 6.7,
      "duration": "1h 54m",
      "description": "On Cybertron, the Autobots, led by Optimus Prime, are on the verge of losing the Great Cybertronian War to their enemies, the Decepticons, had begin making preparations to leave the planet. The Decepticons led by Shockwave, Soundwave and Starscream ambush them during the evacuation, and Optimus sends a young scout, B-127, to Earth in order to set up a base of operations where the Autobots can regroup. B-127 reaches Earth alone in 1987, crash-landing in California and disrupting a training exercise being conducted by Sector 7, a secret government agency that monitors extraterrestrial activity on Earth. Sector 7 agent Colonel Jack Burns presumes B-127 to be a hostile invader and attacks, driving B-127 into the forest, where he is then ambushed by the Decepticon Blitzwing. When B-127 refuses to reveal Optimus' whereabouts, Blitzwing spitefully tears out his voice-box and damages his memory core. B-127 manages to destroy Blitzwing before collapsing from his wounds. Before entering stasis, B-127 scans and transforms into a yellow 1967 Volkswagen Beetle.",
      "year": 2018,
      "released": "13 December 2018",
      "boxOffice": "$467,989,645 ",
      "country": "United States, China",
      "production": "Hasbro, Di Bonaventura Pictures",
      "actors": "Hailee Steinfeld, John Cena",
      "director": "Travis Knight",
      "writers": "Christina Hodson",
      "genres": ["Action", "Adventure", "Sci-Fi"],
      "favourites": false
    },
    {
      "id": 6,
      "name": "Aladdin",
      "rating": 6.5,
      "imdb": 6.9,
      "duration": "2h 8m",
      "description": "A kind-hearted street urchin Aladdin vies for the love of the beautiful princess Jasmine, the princess of Agrabah. When he finds a magic lamp, he uses the genie's magic power to make himself a prince in order to marry her. He's also on a mission to stop the powerful Jafar who plots to steal the magic lamp that could make his deepest wishes come true.",
      "year": 2019,
      "released": "23 May 2019",
      "boxOffice": "$1,054,304,000",
      "country": "United States, United Kingdom",
      "production": "Walt Disney, PicturesLin, PicturesRideback",
      "actors": "Will Smith, Mena Massoud, Naomi Scott",
      "director": "Guy Ritchie",
      "writers": "John August, Guy Ritchie",
      "genres": ["Comedy", "Adventure", "Family", "Fantasy", "Romance"],
      "favourites": false
    },
    {
      "id": 7,
      "name": "Jurassic World",
      "rating": 6.8,
      "imdb": 6.9,
      "duration": "2h 4m",
      "description": "Twenty-two years after the original Jurassic Park failed, the new park, also known as Jurassic World, is open for business. After years of studying genetics, the scientists on the park genetically engineer a new breed of dinosaur, the Indominus Rex. When everything goes horribly wrong, will our heroes make it off the island?",
      "year": 2015,
      "released": "11 June 2015",
      "boxOffice": "$1,671,537,444",
      "country": "United States",
      "production": "Universal Pictures, Amblin Entertainment, Legendary Entertainment",
      "actors": "Chris Pratt, Bryce Dallas Howard, Irrfan Khan",
      "director": "Colin Trevorrow",
      "writers": "Rick Jaffa, Amanda Silver, Colin Trevorrow",
      "genres": ["Action", "Adventure", "Sci-Fi"],
      "favourites": false
    },
    {
      "id": 8,
      "name": "The Witches",
      "rating": 5.2,
      "imdb": 5.3,
      "duration": "1h 46m",
      "description": "Reimagining Roald Dahl's beloved story for a modern audience, Robert Zemeckis's visually innovative film tells the darkly humorous and heartwarming tale of a young orphaned boy who, in late 1967, goes to live with his loving Grandma in the rural Alabama town of Demopolis. As the boy and his grandmother encounter some deceptively glamorous but thoroughly diabolical witches, she wisely whisks him away to a seaside resort. Regrettably, they arrive at precisely the same time that the world's Grand High Witch has gathered her fellow cronies from around the globe-undercover-to carry out her nefarious plans. Zemeckis is joined by a world-class team of filmmakers, including Alfonso Cuarón, Guillermo del Toro and Kenya Barris. The cast includes powerhouse performances from Anne Hathaway, Octavia Spencer, Stanley Tucci, Kristin Chenoweth and Chris Rock, with newcomer Jahzir Kadeen Bruno as the brave young hero.",
      "year": 2020,
      "released": "29 October 2020",
      "boxOffice": "$29,303,571 ",
      "country": "United States, Canada, Mexico",
      "production": "Warner Bros., ImageMovers, Canadian Film or Video Production Tax Credit (CPTC)",
      "actors": "Anne Hathaway, Octavia Spencer, Stanley Tucci, Chris Rock",
      "director": "Robert Zemeckis",
      "writers": "Robert Zemeckis, Kenya Barris, Guillermo del Toro",
      "genres": ["Adventure", "Comedy", "Family", "Fantasy", "Horror"],
      "favourites": false
    },
    {
      "id": 9,
      "name": "Dolittle",
      "rating": 5.4,
      "imdb": 5.6,
      "duration": "1h 41m",
      "description": "After his wife's death, Dr. John Dolittle (Robert Downey, Jr.) decided to hide from the world with his beloved animals. But he has to take a journey to a mysterious island to find a healing tree, which is the only medicine that can help the dying Queen Victoria (Jessie Buckley) in Buckingham Palace.",
      "year": 2020,
      "released": "20 February 2020",
      "boxOffice": "$251,410,631 ",
      "country": "United States, China, Japan, United Kingdom",
      "production": "Universal Pictures, Perfect World Pictures, Roth/Kirschenbaum Films",
      "actors": "Robert Downey Jr., Antonio Banderas, Michael Sheen",
      "director": "Stephen Gaghan",
      "writers": "Dan Gregor, Stephen Gaghan, Doug Mand",
      "genres": ["Adventure", "Comedy", "Family", "Fantasy"],
      "favourites": false
    },
    {
      "id": 10,
      "name": "Avengers: Endgame",
      "rating": 8.4,
      "imdb": 8.6,
      "duration": "3h 1m",
      "description": "After the devastating events of Avengers: Infinity War (2018), the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos's actions and undo the chaos to the universe, no matter what consequences may be in store, and no matter who they face...",
      "year": 2019,
      "released": "29 April 2019",
      "boxOffice": "$2,799,439,100 ",
      "country": "United States",
      "production": "Marvel Studios, Walt Disney Pictures",
      "actors": "Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson",
      "director": "Anthony Russo, Joe Russo",
      "writers": "Christopher Markus, Stephen McFeely, Stan Lee",
      "genres": ["Action", "Adventure", "Drama", "Sci-Fi"],
      "favourites": false
    },
    {
      "id": 11,
      "name": "Harry Potter and the Sorcerer's Stone",
      "rating": 7.3,
      "imdb": 7.6,
      "duration": "2h 32m",
      "description": "This is the tale of Harry Potter (Daniel Radcliffe), an ordinary eleven-year-old boy serving as a sort of slave for his aunt and uncle who learns that he is actually a wizard and has been invited to attend the Hogwarts School for Witchcraft and Wizardry. Harry is snatched away from his mundane existence by Rubeus Hagrid (Robbie Coltrane), the groundskeeper for Hogwarts, and quickly thrown into a world completely foreign to both him and the viewer. Famous for an incident that happened at his birth, Harry makes friends easily at his new school. He soon finds, however, that the wizarding world is far more dangerous for him than he would have imagined, and he quickly learns that not all wizards are ones to be trusted.",
      "year": 2002,
      "released": "21 March 2002",
      "boxOffice": "$1,023,842,938 ",
      "country": "United States, United Kingdom",
      "production": "Warner Bros., Heyday Films, 1492 Pictures",
      "actors": "Daniel Radcliffe, Rupert Grint, Maggie Smith",
      "director": "Chris Columbus",
      "writers": "J.K. Rowling",
      "genres": ["Adventure", "Family", "Fantasy"],
      "favourites": false
    },
    {
      "id": 12,
      "name": "Maleficent",
      "rating": 6.7,
      "imdb": 6.9,
      "duration": "1h 37m",
      "description": "A beautiful, pure-hearted young woman, Maleficent has an idyllic life growing up in a peaceable forest kingdom, until one day when an invading army threatens the harmony of the land. Maleficent rises to be the land's fiercest protector, but she ultimately suffers a ruthless betrayal - an act that begins to turn her pure heart to stone. Bent on revenge, Maleficent faces a battle with the invading king's successor and, as a result, places a curse upon his newborn infant Aurora. As the child grows, Maleficent realizes that Aurora holds the key to peace in the kingdom - and perhaps to Maleficent's true happiness as well.",
      "year": 2014,
      "released": "29 May 2014",
      "boxOffice": "$759,853,685 ",
      "country": "United States",
      "production": "Jolie Pas, Roth Films, Walt Disney Pictures",
      "actors": "Angelina Jolie, Elle Fanning, Sharlto Copley",
      "director": "Robert Stromberg",
      "writers": "Linda Woolverton, Charles Perrault, Milt Banta",
      "genres": ["Adventure", "Family", "Fantasy", "Romance"],
      "favourites": false
    },
    {
      "id": 13,
      "name": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
      "rating": 6.6,
      "imdb": 6.9,
      "duration": "2h 23m",
      "description": "Four children from the same family have to leave their town because of the bombings of WWII. A woman and a professor take the children to their house. While playing a game of hide-and-seek, the youngest member of the family, Lucy, finds a wardrobe to hide in. She travels back and back into the wardrobe and finds a place named Narnia. After going in twice, the four children go in together for the last time. They battle wolves, meet talking animals, encounter an evil white witch and meet a magnificent lion named Aslan. Will this be the end of their journey to Narnia or will they stay?",
      "year": 2005,
      "released": "22 December 2005",
      "boxOffice": "$745,013,115",
      "country": "United States, United Kingdom",
      "production": "Walt Disney Pictures, Walden Media",
      "actors": "Tilda Swinton, Georgie Henley, William Moseley",
      "director": "Andrew Adamson",
      "writers": "Ann Peacock, Christopher Markus",
      "genres": ["Adventure", "Family", "Fantasy"],
      "favourites": false
    },
    {
      "id": 14,
      "name": "Charlie and the Chocolate Factory",
      "rating": 6.4,
      "imdb": 6.7,
      "duration": "1h 55m",
      "description": "When Willy Wonka decides to let five children into his chocolate factory, he decides to release five golden tickets in five separate chocolate bars, causing complete mayhem. The tickets start to be found, with the fifth going to a very special boy, called Charlie Bucket. With his Grandpa, Charlie joins the rest of the children to experience the most amazing factory ever. But not everything goes to plan within the factory.",
      "year": 2005,
      "released": "25 August 2005",
      "boxOffice": "$474,968,763",
      "country": "United States, United Kingdom",
      "production": "Warner Bros., Village Roadshow Pictures, The Zanuck Company",
      "actors": "Johnny Depp, Freddie Highmore, Helena Bonham Carter",
      "director": "Tim Burton",
      "writers": "Roald Dahl, John August",
      "genres": ["Adventure", "Family", "Fantasy", "Comedy"],
      "favourites": false
    },
    {
      "id": 15,
      "name": "Miss Peregrine's Home for Peculiar Children",
      "rating": 6.5,
      "imdb": 6.7,
      "duration": "2h 7m",
      "description": "When Jacob (Asa Butterfield) discovers clues to a mystery that spans different worlds and times, he finds a magical place known as Miss Peregrine's Home for Peculiar Children. But the mystery and danger deepen as he gets to know the residents and learns about their special powers and their powerful enemies. Ultimately, Jacob discovers that only his own special peculiarity can save his new friends.",
      "year": 2016,
      "released": "6 October 2016",
      "boxOffice": "$296,482,446",
      "country": "United States, United Kingdom, Canada, Belgium",
      "production": "Twentieth Century Fox, Chernin Entertainment, TSG Entertainment",
      "actors": "Samuel L. Jackson, Eva Green, Asa Butterfield",
      "director": "Tim Burton",
      "writers": "Ransom Riggs, Jane Goldman",
      "genres": ["Adventure", "Drama", "Family", "Fantasy", "Thriller"],
      "favourites": false
    },
    {
      "id": 16,
      "name": "The Jungle Book",
      "rating": 7.2,
      "imdb": 7.4,
      "duration": "1h 46m",
      "description": "Living among the wolves in the jungle, young man cub Mowgli quickly learns to live life among his wolf pack and all the animals that inhabit the jungle, but when the villainous tiger Shere Khan threatens Mowgli's life, black panther Bagheera offers to take Mowgli to a nearby man village where he will be safe from the tiger's wrath. Along the way, Mowgli gets tangled up in a series of encounters with a sly snake named Kaa, a swimmingly ruthless gigantopithecus named King Louie and a lazy bear named Baloo, who quickly becomes his guide to the 'bear necessities' of life.",
      "year": 2016,
      "released": "7 April 2016",
      "boxOffice": "$967,724,775",
      "country": "United States, United Kingdom",
      "production": "Fairview Entertainment, Moving Picture Company (MPC), Prime Focus",
      "actors": "Neel Sethi, Bill Murray, Idris Elba",
      "director": "Jon Favreau",
      "writers": "Justin Marks, Rudyard Kipling",
      "genres": ["Adventure", "Drama", "Family", "Fantasy"],
      "favourites": false
    },
    {
      "id": 17,
      "name": "The Golden Compass",
      "rating": 6.3,
      "imdb": 6.1,
      "duration": "1h 53m",
      "description": "It was no ordinary life for a young girl: living among scholars in the hallowed halls of Jordan College and tearing unsupervised through Oxford's motley streets on mad quests for adventure. But Lyra's greatest adventure would begin closer to home, the day she heard hushed talk of an extraordinary particle. Microscopic in size, the magical dust--discovered in the vast Arctic expanse of the North--was rumored to possess profound properties that could unite whole universes. But there were those who feared the particle and would stop at nothing to destroy it. Catapulted into the heart of a terrible struggle, Lyra was forced to seek aid from clans, 'gyptians, and formidable armored bears. And as she journeyed into unbelievable danger, she had not the faintest clue that she alone was destined to win, or to lose, this more-than-mortal battle...",
      "year": 2007,
      "released": "6 December 2007",
      "boxOffice": "$372,234,864",
      "country": "United States, United Kingdom",
      "production": "New Line Cinema, Ingenious Film Partners, Scholastic Productions",
      "actors": "Nicole Kidman, Daniel Craig, Dakota Blue Richards",
      "director": "Chris Weitz",
      "writers": "Chris Weitz, Philip Pullman",
      "genres": ["Adventure", "Family", "Fantasy"],
      "favourites": false
    },
    {
      "id": 18,
      "name": "Alice in Wonderland",
      "rating": 6.6,
      "imdb": 6.4,
      "duration": "1h 48m",
      "description": "Alice, an unpretentious and individual 19-year-old, is betrothed to a dunce of an English nobleman. At her engagement party, she escapes the crowd to consider whether to go through with the marriage and falls down a hole in the garden after spotting an unusual rabbit. Arriving in a strange and surreal place called Underland, she finds herself in a world that resembles the nightmares she had as a child, filled with talking animals, villainous queens and knights, and frumious bandersnatches. Alice realizes that she is there for a reason--to conquer the horrific Jabberwocky and restore the rightful queen to her throne.",
      "year": 2010,
      "released": "4 March 2010",
      "boxOffice": "$1,025,468,216",
      "country": "United States",
      "production": "Walt Disney Pictures, Roth FilmsTeam Todd",
      "actors": "Mia Wasikowska, Johnny Depp, Helena Bonham Carter",
      "director": "Tim Burton",
      "writers": "Linda Woolverton, Lewis Carroll",
      "genres": ["Adventure", "Family", "Fantasy", "Mystery"],
      "favourites": false
    },
    {
      "id": 19,
      "name": "Fantastic Beasts and Where to Find Them",
      "rating": 7.1,
      "imdb": 7.2,
      "duration": "2h 12m",
      "description": "In mid-1920s New York, Newt Scamander, a British young activist wizard, arrives in the city, holding a mysterious leather suitcase sheltering diverse and magical creatures. Then, in the face of a fragile equilibrium of secrecy and the increasing disasters ascribed to the dark wizard Gellert Grindelwald, Newt's precious suitcase suddenly goes missing. And before long, this unforeseen complication catches Senior Auror Percival Graves' attention. Now, Newt is his target as an invisible, devastating, and unpredictable menace still wreaks havoc on 5th Avenue. In the end, is there a hidden agenda behind Graves' intentions? What will happen to the remaining fantastic beasts still on the loose?",
      "year": 2016,
      "released": "17 November 2016",
      "boxOffice": "$814,044,001",
      "country": "United States, United Kingdom",
      "production": "Heyday Films, Warner Bros.",
      "actors": "Eddie Redmayne, Katherine Waterston, Alison Sudol",
      "director": "David Yates",
      "writers": "J.K. Rowling",
      "genres": ["Adventure", "Family", "Fantasy"],
      "favourites": false
    },
    {
      "id": 20,
      "name": "Pirates of the Caribbean: Dead Men Tell No Tales",
      "rating": 6.6,
      "imdb": 6.5,
      "duration": "2h 9m",
      "description": "Captain Jack Sparrow (Johnny Depp) finds the winds of ill-fortune blowing even more strongly when deadly ghost pirates led by his old nemesis, the terrifying Captain Salazar (Javier Bardem), escape from the Devil's Triangle, determined to kill every pirate at sea...including him. Captain Jack's only hope of survival lies in seeking out the legendary Trident of Poseidon, a powerful artifact that bestows upon its possessor total control over the seas.",
      "year": 2017,
      "released": "25 May 2017",
      "boxOffice": "$795,922,298",
      "country": "United States, United Kingdom, Australia, Canada",
      "production": "Walt Disney Pictures, Jerry Bruckheimer Films, Infinitum Nihil",
      "actors": "Johnny Depp, Geoffrey Rush, Javier Bardem",
      "director": "Joachim Rønning, Espen Sandberg",
      "writers": "Jeff Nathanson, Terry Rossio, Ted Elliott",
      "genres": ["Action", "Adventure", "Fantasy"],
      "favourites": false
    }
  ]
}
